{"editor/events/index":{"slug":"editor/events/index","filePath":"editor/events/index.md","title":"Events","links":[],"tags":[],"content":"Events are features that can be added to a tile on the level grid, powering complex custom mechanics that you can design.\nThis page lists all events which currently exist in the game. Each subpage documents an event."},"editor/events/trigger":{"slug":"editor/events/trigger","filePath":"editor/events/trigger.md","title":"Trigger","links":["editor/events/trigger","belonging-group"],"tags":[],"content":"The  is a generic event which allows players to activate other events that have been placed in a specified Belonging Group.\nTrigger Condition\nThe Trigger Condition section allows players to specify when the events in the target group.\n\n\nBall -&gt; Pass Through\n\nWhen this condition is set, this  will activate the events in the Target Group when the ball rolls over the tile which the  was placed on. This means that the ball’s X, Y, and Z positions must match the X, Y, and Z positions of the tile for the  to activate. Otherwise, nothing will happen.\n\n\n\nThe affiliated group has been triggered\n\n\nWhen this condition is set, this  will activate the events in the Target Group ID when another  targeting the Belonging Group of this trigger is activated. This essentially allows this trigger to act as a link in a chain.\n\n\nWhen this condition is selected, a field labeled Delay Distance appears below the Condition type. This field allows you to set how long the game waits before activating the trigger.\n\n\nActivation Flow: Trigger A Activation -&gt; Trigger B (this) Delay -&gt; Trigger B (this) Activation\n\n\n\n\nThe distance is equal to\n\nWhen this condition is set, this  will activate the events in the Target Group when the Y distance between the ball and this  matches the amount specified in the Trigger Distance slider.\n\n\n\nTarget Group ID\nThis field allows you to set which group ID this trigger will activate once the Trigger Condition is met. All of the events which have their Belonging Group set to this ‘s Target Group ID will be activated.\nBelonging Group\nThis section is shared across all events.\nIn the first box, you are able to select which group IDs this event belongs to. If the Trigger type is set to The affiliated group has been triggered and a  activates any of the groups that this event belongs to, this event will also activate.\nIn the second box, you can set the positional offset of the trigger independently from the tile and the object."},"editor/index":{"slug":"editor/index","filePath":"editor/index.md","title":"Editor","links":[],"tags":[],"content":"The RollerCraft UGC Editor allows players to create their own unique and creative levels."},"editor/music":{"slug":"editor/music","filePath":"editor/music.md","title":"Music","links":[],"tags":[],"content":"Music is a central part to a RollerCraft level, so it is important to choose an engaging track that players will enjoy listening to multiple times over. A bad song can ruin a RollerCraft level altogether.\nWhen selecting music for your level, you can choose a few select songs from the original Rolling Sky library, all RollerCraft originals, some songs from Jamendo Music, most songs from NoCopyrightSounds (NCS), and local any MP3 audio files.\n\n\n                  \n                  Note \n                  \n                \n\n\nLocally selected music will not be uploaded to the RollerCraft server, meaning that others cannot hear the music. Please keep this in consideration if you intend to upload your level. Levels with local music may not be rated or featured.\n\n\n\nIn the level properties screen, a field labeled Music allows you to select the music your level plays from the sources above.\n\nWhen tapping on the Music: input element, a screen titled Local Music will be shown, displaying all the music you have already downloaded. Some songs will come pre-packaged when installing the game. To select from the sources mentioned above, tap on the  in the top right.\n\nOnce you have found a song that you enjoy, tap the  to download the music to your device. You will be prompted to allocate a portion of your device’s storage to download the music, to which you can press Confirm.\n\nTap on the  to preview the music, and tap the title of the music to select it. The music will then be available in the Local Music screen for easy access. After you finish selecting your music, you can press  to save your choice of music."},"editor/objects":{"slug":"editor/objects","filePath":"editor/objects.md","title":"Objects","links":[],"tags":[],"content":"Objects are the basic components that make up a RollerCraft level. In the objects category are floors and obstacles.\nFloors\n… content\nObstacles\n… content"},"editor/themes":{"slug":"editor/themes","filePath":"editor/themes.md","title":"Themes","links":[],"tags":[],"content":"Theme Page"},"index":{"slug":"index","filePath":"index.md","title":"RollerCraft","links":["editor"],"tags":[],"content":"RollerCraft is a game based off Rolling Sky developed by Minimax PTE. LTD. Players drag a ball horizontally across the screen to dodge obstacles and collect items while progressing forward at a constant rate toward the finish line.\nThe game contains both official levels and user-created levels. This website guides both beginner editors and experienced editors.\nMD Inline Emoji Test   \nFor Beginner Editors\nIf you haven’t ever created a Rolling Sky or RollerCraft level before, don’t worry! This section will guide you step-by-step on how to get started creating.\n\nFor Experienced Editors\nIf you are familiar with RollerCraft’s UGC Editor, feel free to look through the Editor pages."}}